Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་ཐབས་འདིས་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་ལས་ཡོངས་སུ་བཀྲོལ་ཅིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པར་བྱ་བའི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་ཕྱིར་མི་ལྡོག་པར་བྱེད་དོ། །རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་འདི་ཐོབ་པར་ཟད་ན། དེས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་རྣམས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ལ་རྣམ་པར་དག་པ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཁོང་དུ་ཆུད་པར་རྟོགས་པ། དགེ་བའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་རྒྱུན་མི་གཅོད་པའི་རྒྱུད་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱུད་ལ་རྟག་ཏུ་མཉམ་པར་གཞག་པ། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་ཤིང་སྤྱོད་པ་ལས་ཕྱིར་མི་ལྡོག་པའི་རྒྱུད་དང་ལྡན་པ། དུས་གསུམ་ཐམས་ཅད་ཀྱི་ཚུལ་རྗེས་སུ་རྟོགས་པའི་རྒྱུད་དང་ལྡན་པ།
en: “Noble one, through this method, I liberate all beings from fear and cause them to develop an irreversible aspiration for the highest, complete enlightenment so that they will attain all the Dharmas of the buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཀློང་ཡོངས་སུ་འཁྱིལ་བའི་རྒྱུད་ལ་མཁས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་དགེ་བའི་སེམས་རྣམ་པར་ཞི་བར་བྱེད་པའི་རྒྱུད་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་སེམས་ཡོངས་སུ་འཕེལ་བའི་རྒྱུད་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་རྒྱུད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱེད་པའི་རྒྱུད་དང་ལྡན་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Noble one, I know this gateway to bodhisattva activity called the unimpeded gateway to great compassion, but how could I know the conduct or describe the qualities of the completely good bodhisattvas who have the pure domain of the prayers of all buddhas; who have realized the completely good conduct of bodhisattvas; who have an unbroken continuity of creating virtuous qualities; who are always resting in a continuity of the samādhi of all bodhisattvas; who have nonregressing conduct while residing in all kalpas; who have the continuous understanding of the ways of all three times; who are skilled in the continuity of the turning of the cycle of all world realms; who have the continuity of ending nonvirtuous mentalities in all beings; who have a continuity of increasing the virtuous mentalities of all beings; and who have the continuity of countering the continuity of saṃsāra for all beings?”

source: དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །གཡས་ཕྱོགས་བསྐོར་བ་བྱས་ཏེ་གུས་པར་བཀུར་བསྟོད་ནས། །ནོར་བཟངས་ཤིན་ཏུ་དུལ་བ་ལྷོ་ཕྱོགས་རྒྱུད་དུ་སོང་། །སྤྱན་རས་གཟིགས་དབང་དྲང་སྲོང་སྙིང་རྗེ་རྣམ་སྤྱོད་པ། །རིན་ཆེན་རིའི་སུལ་ན་གནས་པར་དེས་ཀྱང་མཐོང་། །
en: Concerning this it is said: Sudhana, who was self-disciplined, circumambulated, Praised reverently, and departed on the southern road— He saw, residing in a cleft in a precious mountain, Avalokiteśvara, a ṛṣi who abided in compassion.

source: རིན་ཆེན་སྣ་ཚོགས་རྡོ་རྗེའི་རི་ཡི་སྨན་ལྗོངས་ན། །
en: {1} The wise one was seated in the center of a lotus on a lion throne On the side of the diamond mountain with various precious jewels.

source: པདྨའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་བརྟན་པར་འདུག ལྷ་དང་ལྷ་མིན་ཀླུ་དང་སྲིན་པོ་མིའམ་ཅི། །རྒྱལ་བའི་སྲས་ཀྱིས་བསྐོར་ཅིང་དེ་ལ་ཆོས་ཀྱང་སྟོན། །
en: He was teaching the Dharma to the devas, asuras, nāgas, Kinnaras, rākṣasas, and bodhisattvas who encircled him.

source: མཐོང་ནས་ནོར་བཟངས་དགའ་བ་ཚད་མེད་སྐྱེས་པར་གྱུར། །བསྙེན་ཏེ་ཡོན་ཏན་རྒྱ་མཚོའི་རྐང་ལ་ཕྱག་འཚལ་ནས། །
en: {2} When Sudhana saw him, he was filled with unequaled joy, Approached him, and bowed down to the feet of the ocean of qualities.

source: ཅི་ནས་བཟང་པོའི་སྤྱོད་པ་བདག་གིས་ཐོབ་འགྱུར་བར། །འཕགས་པས་ཐུགས་རྗེ་བསྐྱེད་དེ་གདམས་ཤིང་བསླབ་པར་གསོལ། །བསོད་ནམས་བརྒྱ་པས་བརྒྱན་པའི་དྲི་མེད་ལག་བརྐྱང་སྟེ། །
en: He said, “Ārya, have compassion and teach to me the training So that I may attain good conduct.”

source: འོད་སྤྲིན་དྲ་བ་རྒྱ་ཆེན་བཟང་པོ་རབ་བཏོན་ནས། །ནོར་བཟངས་སྤྱི་བོར་བཞག་སྟེ་སེམས་ཅན་རྣམ་དག་པ། །སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཁས་པས་ཚིག་འདི་སྨྲས། །སངས་རྒྱས་སྲས་བོ་ང་ནི་རྣམ་ཐར་གཅིག་སྒོ་ཤེས། །ཡེ་ཤེས་སྙིང་པོ་རྒྱལ་བ་ཀུན་གྱི་ཐུགས་རྗེ་སྡུག །
en: {3} Extending his stainless hand, adorned by a hundred merits, Which emitted excellent, vast networks of clouds of light, And placing it upon Sudhana’s head, that pure being, The wise one Avalokiteśvara, spoke these words: {4} “Son of the buddhas, I know one gateway to liberation, Which is the mass of compassion, the essence of wisdom of all the jinas, Which arises in order to gather and liberate all beings, And my love for them thus courses everywhere.

source: འགྲོ་བ་ཐམས་ཅད་བསྐྱབ་ཅིང་ཡོངས་སུ་བསྡུ་ཕྱིར་བྱུང་། །ཀུན་ཏུ་བདག་ཉིད་རང་ལ་བྱམས་པ་བཞིན་དུ་རྒྱུ། །འགྲོ་བ་མང་པོ་ཐམས་ཅད་སྡུག་བསྔལ་ཀུན་ལས་སྐྱོབ། །
en: {5} “I protect all beings from every suffering.

source: གང་རྣམས་དམ་དུ་བཅིངས་ཤིང་དགྲ་ལག་ཕྱིན་པ་དང་། །ལུས་ལ་གཟེར་ཅིང་དེ་བཞིན་བཙོན་རར་བཙུད་པ་ཡང་། །ང་ཡི་མིང་ཐོས་བཅིངས་ཤིང་བཟུང་བ་ཐར་བར་འགྱུར། །
en: Those who are tightly bound, who are in the hands of enemies, Whose bodies are struck, and who are put into prisons On hearing my name are freed from bondage.

source: རྒྱལ་པོ་དག་ལ་ཉེས་པའི་གཡོན་བྱས་གསད་སྤངས་པ། །དེ་ཚེ་དེ་དག་ང་ཡི་མིང་ཡང་དྲན་གྱུར་ན། །
en: {6} “Those who have broken the law will escape execution When at that time they remember my name.

source: མདའ་འཕངས་དེ་ཡི་ལུས་ལ་ཕོག་པར་མི་འགྱུར་ཏེ། །
en: Arrows that are fired will not hit their bodies.

source: མཚོན་རྣོན་བཏབ་ཀྱང་དེ་དག་མི་འཛུག་སྒལ་བར་འགྱུར། །
en: Weapons that strike them will be not pierce them.

source: དབང་པོའི་འཁོར་དུ་ཕྱིན་ཀྱང་གང་རྣམས་རྩོད་གྱུར་པ། །དགྲ་རྣམས་ཀུན་ལས་རྒྱལ་འགྱུར་གྲགས་པ་འཐོབ་པར་འགྱུར། །གྲགས་དང་གྲོགས་དང་རིགས་དང་ནོར་རྣམས་འཕེལ་བར་འགྱུར། །ང་ཡི་མིང་དྲན་དེ་དག་ཐུབ་པ་མེད་པར་འགྱུར། །
en: {7} “Those who remember my name will be invincible. Though they enter the courts of lords, no matter who disputes with them, They will be victorious over all adversaries and attain excellence, And their fame, friends, families, and wealth will increase.

source: གང་གིས་ང་ཡི་མིང་ནི་རྗེས་སུ་དྲན་བྱས་པ། །དེ་དག་རྐུན་པོས་འཇིགས་དོགས་དགྲས་འཇིགས་ནགས་ཕྱིན་ཏེ། །སེང་གེ་དོམ་གཟིག་གཅན་ཟན་གཡག་རྒོད་སྦྲུལ་གང་ཡང་། །དགྲ་རྣམས་ཀུན་ལས་རྒྱལ་ཞིང་འཇིགས་པ་མེད་པར་འགྱུར། །
en: {8} “Anyone who remembers my name Entering forests fearful with thieves, fearful with enemies, With lions, bears, leopards, wild beasts, yaks, and snakes, Will be free of fear and victorious over enemies.

source: གང་རྣམས་ལ་ལས་ང་ཡི་མིང་ཞིག་དྲན་བྱས་ན། །སྡང་བའི་སེམས་ཀྱིས་རིན་ཆེན་ལྟོངསསུ་བོར་གྱུར་ཏམ། །སོལ་མདག་ལྕི་མེ་རབ་ཏུ་འབར་བར་བོར་གྱུར་ཀྱང་། །མེ་རྣམས་པད་མོས་གང་བའི་ཆུ་ཡི་གཏེར་དུ་འགྱུར། །
en: {9} “When anyone who remembers my name Is malevolently thrown from the summit of a great mountain Or hurled into a blazing fire of coals, The fire will transform into a treasure of water filled with lotuses.

source: ང་ཡི་མིང་ནི་སྐད་འགའ་ཡུད་ཙམ་རྗེས་དྲན་ན། །རྒྱ་མཚོའི་ཆུར་བོར་དེ་ཡི་ནང་དུ་འཆི་མི་འགྱུར། །
en: {10} “Anyone who instantly remembers my name When thrown into the sea will not die there.

source: ཆུ་བོས་མི་འཁྱེར་མེ་ཡི་དབུས་སུ་ཚིག་མི་འགྱུར། །
en: They will not be swept away by rivers or burn in the midst of fire.

source: དོན་མེད་ཀུན་ཏུ་མི་འགྱུར་དོན་རྣམས་འགྲུབ་པར་འགྱུར། །ཤིང་སྒྲོག་དབྱིག་ཆིངས་ལྕགས་སྒྲོག་དེ་བཞིན་ལྟུང་རྣམས་དང་། །
en: In everything they will not fail but will be successful.

source: བརྙས་ཤིང་ཁྱད་བསད་དེ་བཞིན་བྲིད་ཅིང་བསླུས་པ་དང་། །སྤྱོས་ཤིང་བསྡིགས་ཏེ་གཤེ་དང་སྨ་ཕབ་རྣམ་པ་ལས། །ང་ཡི་མིང་ཙམ་དྲན་པར་བྱས་ན་ཐར་པ་ཐོབ། །གང་རྣམས་ཤར་གཉེར་སྣ་ཚོགས་གླགས་ལྟ་ཇི་སྙེད་དང་། །
en: {11} “Those who remember my name will attain liberation From stocks, chains, manacles, and unjust punishments; Dishonor, disrespect, constraints, and deception; Abuse, beatings, threats, and scolding.

source: གང་རྣམས་རྟག་ཏུ་ཞེ་སྡང་མི་སྙན་བརྗོད་པའི་རྣམས། །ང་ཡི་མིང་ཐོས་དྲན་བྱས་སྙན་པར་བརྗོད་པར་འགྱུར། །མཐོང་བ་ཙམ་གིས་མོད་ལ་བྱམས་པའི་སེམས་ཀྱང་སྐྱེ། །ང་ཡི་མིང་ཙམ་ལ་ལ་གང་གིས་དྲན་བྱས་ནས། །
en: {12} “All those who are hostile and seek to harm, Who are always angry and speak unpleasant words, Will become friendly the moment they see Those who have heard and remember my name and will praise them.

source: གནོད་པའི་དོན་དུ་རོ་ལངས་སྔགས་དང་བྱད་བྱེད་པའི། །དགྲ་རྣམས་རྟག་ཏུ་དེ་ཡི་ཟིལ་གྱིས་ནོན་པར་འགྱུར། །མ་ལུས་དུག་གིས་དེ་ཡི་ལུས་ལ་མི་ཚུགས་སོ། །ལ་ལ་གང་གིས་ང་ཡི་མིང་ཙམ་དྲན་བྱས་ན། །
en: {13} “Anyone who remembers my name Will always overpower those enemies Who, in order to harm, practice vetāla mantras and sorcery, And they will not be harmed by any poison.

source: ཀླུ་དབང་སྲིན་ཚོགས་མཁའ་ལྡིང་ཤ་ཟ་ཐམས་ཅད་དང་། །གྲུལ་བུམ་སྲུལ་པོ་འཚེ་བྱེད་གཏུམ་པོའི་སེམས་དང་ལྡན། །མདངས་འཕྲོག་འཇིགས་བྱེད་རྨི་ལམ་འོང་བའང་ཞི་བར་འགྱུར། །
en: {14} “Those who have remembered my name will pacify All nāga lords, hordes of rākṣasas, garuḍas, piśācas, Kumbhāndas, and pūtanas who with wrathful minds cause harm, Who steal vitality, and who terrify in dreams.

source: ང་ཡི་མིང་ནི་སྐད་ཅིག་ཡུད་ཙམ་དྲན་བྱས་ཀྱང་། །ཕ་དང་མ་དང་གཉེན་བཤེས་མཛའ་བ་ཀུན་དང་ཡང་། །འབྲལ་བར་མི་འགྱུར་སྡང་དང་འགྲོགས་པར་དེ་བཞིན་མིན། །ནོར་ཟད་མི་འགྱུར་ཕོངས་པའི་དངོས་སུ་མི་འགྱུར་རོ། །
en: {15} “Those who remember my name for a moment Will not become separated from parents, friends, and relatives, And will not be in the company of those who dislike them; Their wealth will not be exhausted, and they will not become poor.

source: ང་ཡི་མིང་གི་རྗེས་སུ་ལ་ལ་དྲན་བྱེད་ན། །འདི་ནས་ཤི་འཕོས་མནར་མེད་སེམས་དམྱལ་མི་འགྲོ་སྟེ། །བྱོལ་སོང་སྐྱེ་གནས་ཡི་དགས་མི་ཁོམ་གནས་སུ་མིན། །སེམས་ཅན་དག་ལ་ལྷ་དང་མི་ཡི་གནས་སུ་སྐྱེ། །ང་ཡི་མིང་ནི་ལ་ལ་གང་གིས་དྲན་བྱས་ན། །
en: {16} “Anyone who remembers my name Will not go to the Avīci hell when they die But will be reborn as a good being, a deva or human, And not as an animal or a preta, or in an unfortunate existence.

source: དམུས་ལོང་ཞར་བ་འོན་པ་ཞ་བོར་མི་འགྱུར་ཏེ། །འཐེང་པོ་ལོང་བར་མི་འགྱུར་གསལ་སྨྲ་བལྟ་སྡུག་འགྱུར། །བསྐལ་པ་བྱེ་བ་མང་པོར་དབང་པོར་ཀུན་ལྡན་འགྱུར། །
en: {17} “Those who remember my name will become humans Who are not blind, one-eyed, deaf, unable to walk, Or with a limp, but who speak clearly and have a pleasant appearance, And they will possess all faculties for many millions of kalpas.

source: ལ་ལ་གང་གིས་ང་ཡི་མྱིང་ནི་རྗེས་དྲན་ན། །སེམས་ཅན་དག་པ་འདི་ནས་ཤི་འཕོས་ཕྱོགས་བཅུ་ཡི། །འཇིག་རྟེན་ཁམས་སུ་སངས་རྒྱས་མངོན་སུམ་སྐྱེ་བར་འགྱུར། །སངས་རྒྱས་མཐོང་འགྱུར་དེ་དག་ཆོས་ཀྱང་ཐོས་པར་འགྱུར། །
en: {18} {19} “Anyone who remembers my name Will be a pure being who on passing away will be reborn In the presence of buddhas in world realms in the ten directions, Will see the buddhas, and will hear their Dharma.

source: འདི་དང་དེ་བཞིན་གཞན་དག་ཐབས་མང་ཇི་སྙེད་ཀྱིས། །འགྲོ་བར་སེམས་ཅན་ང་འདུལ་གཞལ་དང་ཟད་མི་ནུས། །
en: {20} “These and all my many other methods For guiding beings in worlds are endless and innumerable.

source: སངས་རྒྱས་སྲས་པོ་ངས་ནི་རྣམ་ཐར་གཅིག་བསྒོམས་ཏེ། །ཡོན་ཏན་ཅན་གྱི་ཡོན་ཏན་ཐམས་ཅད་ངས་མི་ཤེས། །
en: Son of the buddhas, I meditate on this one liberation, But I do not know all the qualities of those with qualities.”

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་ཞེས་བྱ་བ་ཤར་ཕྱོགས་ནས་ནམ་མཁའི་དབྱིངས་ལས་འོངས་ཏེ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་ཡུག་གི་རྩེ་མོར་འདུག་གོ །བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བས།
en: {21} {22} At that time the bodhisattva Ananyagāmin came from the east through the sky and resided on a peak of the Cakravāla mountain range in the Sahā world realm.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་ཡུག་གི་རྩེ་མོ་ལ་རྐང་པ་གཉིས་བོར་མ་ཐག་དུ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། རིན་པོ་ཆེ་དུ་མའི་རང་བཞིན་དུ་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །
en: The moment that the bodhisattva Ananyagāmin’s feet landed on a peak of the Cakravāla mountain range in the Sahā world realm, the Sahā world realm shook in six ways and transformed into being composed of many jewels.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མྱི་འགྲོ་བ་དེས། ཉི་མ་དང་ཟླ་བའི་འོད་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པ་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་།
en: The bodhisattva Ananyagāmin outshone the light of the sun and moon.

source: ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། མེ་དང་རིན་པོ་ཆེ་དང་། གློག་དང་། སྐར་མའི་འོད་ཀྱང་ཟིལ་གྱིས་ནོན་པ་དེ་ལྟ་བུའི་འོད་ལུས་ལས་བཀྱེ་སྟེ།
en: The light from his body outshone devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, the world guardians, fire, jewels, lightning, and starlight.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དག་ཀྱང་སྣང་བར་བྱས། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་།
en: He even illuminated the great hells.

source: གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐིབས་པོ་ཐམས་ཅད་ཀྱང་སྣང་བར་བྱས་ཏེ།
en: He illuminated all dark existences in the realm of animals and the world of Yama.

source: ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱང་དེ་མ་ཐག་ཏུ་ཞིའོ། །
en: He caused all the sufferings in the lower existences to instantly cease.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཡང་ཉམས་སུ་མི་གནོད་པར་གྱུར་ཏོ། །
en: All beings ceased to be tormented by the kleśas.

source: མྱ་ངན་གྱི་ཟུག་རྔུ་དང་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱང་རྩེ་ཟིལ་བར་གྱུར་ཏོ། །
en: Various kinds of misery, pain, and suffering were alleviated.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་དུ་འང་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་ཕབ་སྟེ། མེ་ཏོག་དང་སྤོས་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་རྒྱན་ཐམས་ཅད་དང་ལྡན་པའི་མཆོད་པ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་སྟེ།
en: Rain from clouds of jewels fell over all of this buddha realm, and there also fell rain from clouds of a variety of offerings, the entire display of flowers, perfumes, incense, garlands, ointments, powders, clothing, parasols, banners, and flags.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ངོ་། །དེའི་ལུས་དེའི་གཟུགས་བརྙན་ནི་སེམས་ཅན་ཐམས་ཅད་གནས་སུ་སྣང་བ་སྟེ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་བྱེད་པ་ལ་མངོན་པར་གཞོལ་བས།
en: He then went to where the Bhagavat was, and the image of his body appeared in the residences of all beings, appearing so as to satisfy them in accordance with their wishes.

source: རི་གྲུ་འཛིན་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་དྲུང་དུ་ཡང་ཕྱིན་པར་སྣང་ངོ་། །
en: He also appeared to come before the bodhisattva Avalokiteśvara.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་འཁོར་གྱི་དཀྱིལ་འཁོར་འདིར་ཕྱིན་པ་མཐོང་ངམ།
en: Then the bodhisattva Avalokiteśvara said to Sudhana, the head merchant’s son, “Noble one, did you see the bodhisattva Ananyagāmin coming to the gathering of this assembly?

source: སྨྲས་པ་འཕགས་པ་མཐོང་ངོ་། །
en: “Depart, noble one.

source: སྨྲས་པ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: Go to the bodhisattva Ananyagāmin and ask him, ‘How should a bodhisattva train in bodhisattva conduct?

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bodhisattva Avalokiteśvara, circumambulated the bodhisattva Avalokiteśvara many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bodhisattva Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡེ་ཤེས་ཀྱི་གཏིང་མ་རྙེད་པའི་སེམས་ཀྱིས་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བལྟ་བས་ཀྱང་མ་ངོམས་བཞིན་དུ་བསྒོ་བ་དང་། མི་འགལ་བར་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་གང་ན་བ་དེར་སོང་སྟེ།
en: Ananyagāmin Chapter 31 Sudhana, the head merchant’s son, his mind having acquired Avalokiteśvara’s verses of wisdom, had not had enough of gazing on the bodhisattva Avalokiteśvara, but so as not to disobey his instruction, Sudhana went to where the bodhisattva Ananyagāmin was.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ།
en: He bowed his head to the feet of the bodhisattva Ananyagāmin.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཤད་དུ་གསོལ། །
en: Explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྒོ་ཀུན་ཏུ་འགྲོ་བ་ཐོབ་པའོ། །
en: Then the bodhisattva Ananyagāmin said, “Noble one, I have attained the bodhisattva liberation called the arising of every gateway.”

source: སྨྲས་པ། འཕགས་པ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་གང་གི་ཞབས་ཀྱི་དྲུང་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་སྒོ་ཀུན་ཏུ་འགྲོ་བ་ཞེས་བྱ་བ་འདི་བརྙེས།
en: Sudhana asked, “Ārya, at the feet of which tathāgata did you attain the bodhisattva liberation called the arising of every gateway?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་འདི་ནས་ཇི་སྲིད་ཅིག་ན་མཆིས།
en: How far from here is that world realm?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནས་བཞུད་ནས་ནི་ཇི་སྲིད་ཅིག་ལགས།
en: How long did it take to come from that world realm?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་གནས་འདི་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུས་ཀྱང་ཤེས་པར་དཀའ་སྟེ།
en: The bodhisattva Ananyagāmin said, “Noble one, this is something that is difficult to comprehend for beings such as the śramaṇas and brahmins in this world with its devas, humans, and asuras.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་མི་ལྡོག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མི་འཕྲོགས་པའི་ཡུལ་ཏེ། དེ་ནི་རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་ཟིན་པ། སངས་རྒྱས་ཀྱིས་མ་དགོངས་པ། དགེ་བའི་རྩ་བ་མ་བསྩགས་པ། བསམ་པ་ཡོངས་སུ་མ་དག་པ།
en: It is the power of the bodhisattvas, the irreversible diligence of the bodhisattvas, and the unsurpassable conduct of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་མ་ཐོབ་པ། ཤེས་རབ་ཀྱི་མིག་དང་མི་ལྡན་པ་རྣམས་ཀྱིས་ཐོས་བ་འམ། ཡོངས་སུ་གཟུང་བའམ། ཡིད་ཆེས་པའམ། ཁོང་དུ་ཆུད་པར་བྱ་བར་མི་ནུས་སོ། །
en: “Noble one, those who are not in the care of a kalyāṇamitra, who are not regarded by the buddhas, who have not accumulated the roots of merit, who do not have a pure motivation, who have not attained the faculties of a bodhisattva, and who do not have the eyes of wisdom will not be able to hear of it, grasp it, believe in it, or comprehend it.”

source: སྨྲས་པ། སངས་རྒྱས་ཀྱི་མཐུ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གཟུངས་ཀྱིས་དད་པ་དང་། མོས་པར་བགྱི་ན་འཕགས་པས་བདག་ལ་བཀའ་མི་སྩལ་ཏམ།
en: Sudhana said, “Tell it to me, for I am apprehended by the buddhas and in the care of kalyāṇamitras, and I have faith and aspiration!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ང་ནི་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔལ་གྱི་སྙིང་པོ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་དཔལ་ཀུན་ནས་ཡང་དག་པར་འབྱུང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་འོངས་ཏེ།
en: The bodhisattva Ananyagāmin said, “Noble one, I have come from a world realm in the eastern direction that is called Śrīgarbhavatī, the buddha realm of the Tathāgata Samanta­śrī­saṃbhava.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་ཀུན་ནས་ཡང་དག་པར་འབྱུང་བའི་ཞབས་ཀྱི་དྲུང་ནས་ངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒོ་ཀུན་ཏུ་འགྲོ་བ་འདི་ཐོབ་བོ། །
en: I obtained the bodhisattva liberation called the arising of every gateway at the feet of the Tathāgata Samanta­śrī­saṃbhava.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་དཔལ་གྱི་སྙིང་པོ་དང་ལྡན་པ་དེ་ནས་ང་སོང་ནས་ནི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་འདས་ཏེ།
en: “Noble one, as many kalpas as there are atoms in an anabhilāpyānabhilāpya of buddha realms passed while I came from the world realm Śrīgarbhavatī.

source: སེམས་བསྐྱེད་པ་རེ་རེ་ཞིང་ཡང་གོམ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བོར་རོ། །
en: “With each development of an aspiration, I took as many steps as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: གོམ་པ་རེ་རེས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་ཏེ།
en: With each step, I passed as many buddha realms as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་དང་ལྡན་པར་ཤེས་ཏེ།
en: There was a tathāgata in each of those buddha realms, and I perceived all those buddha bhagavats.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ལ་འང་དེ་བཞི་གཤེགས་པའི་མཆོད་པ་བླ་ན་མེད་པ་ཡིད་ཀྱིས་རང་བཞིན་ཆོས་ཉིད་མངོན་པར་འདུ་བ་བ་མེད་པའི་རྒྱས་བཏབ་པ་དེ་བཞིན་གཤེགས་པས་གནང་བ། བྱང་ཆུབ་སེམས་དཔའི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པས་མཆོད་པ་བྱས་སོ། །
en: To all those tathāgatas I made offerings that were authorized by the tathāgatas and were unsurpassable, composed of the mind, and sealed by the noncomposite nature of phenomena and gave rise to joy in bodhisattvas.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་གྱི་ཁམས་རྒྱ་མཚོ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་ཡང་ཁོང་དུ་ཆུད་དོ། །དེ་དག་ཐམས་ཅད་ཀྱི་དབང་པོའི་འཁོར་ལོ་ཡང་ཡོངས་སུ་ཤེས་ཤིང་བསམ་པ་དང་།
en: “I saw in those world realms an ocean of beings, and I perceived the ocean of all their minds.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་བསྟན་ཏོ། །ཆོས་ཀྱི་དབྱངས་རབ་ཏུ་བསྒྲགས་སོ། །འོད་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་བཀྱེའོ། །ཡོ་བྱད་སྣ་ཚོགས་ཕུན་སུམ་ཚོགས་པས་ཀྱང་ཉེ་བར་བསྡུད་དོ། རང་གི་ལུས་ཀྱང་དེ་དག་ལ་བྱིན་གྱིས་བརླབས་ཏེ། དེ་ནི་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་སྦྱོར་བ་རྒྱུན་མི་འཆད་པའི་ཕྱིར་རོ། །
en: I knew the wheels of all their faculties, and I manifested physical bodies in accord with their aspirations, proclaimed the words of the Dharma, radiated a halo of light, brought them the gift of various necessities, and empowered my own body, so that I could continuously be engaged in ripening and guiding them.

source: ཤར་ཕྱོགས་ནས་ཇི་ལྟར་འོངས་པ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་།
en: “In the same way that I came from the east, I came from the south, from the west, from the north, from the northeast, from the southeast, from the southwest, from the northwest, from below, and from above.

source: ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ནས་ཀྱང་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུ་ངས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྒོ་ཀུན་ཏུ་འགྲོ་བ་ཞེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན། ངས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་ཀུན་ཏུ་མངོན་པར་གཞོལ་བ། ཐ་མི་དད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ལུས་རྣམ་པར་བཀོད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐུན་པར་སྤྱོད་པ།
en: “Noble one, I know only the bodhisattva liberation called the arising of every gateway.

source: ཞིང་ཐམས་ཅད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པ། ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུད་ཀྱི་རྗེས་སུ་སོང་བ། དུས་གསུམ་གྱི་རྒྱུད་མཉམ་པ་ཉིད་དུ་གྱུར་པ། ཆོས་ཕྱོགས་ཀྱི་རྒྱུད་དང་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་ལུས་དང་ལྡན་པ། འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དུ་རྣམ་པར་སྣང་བ། དེ་བཞིན་གཤེགས་པའི་རྒྱུད་ཐམས་ཅད་ལ་རྣམ་པར་རྟོག་པ་མེད་པ། ཆགས་པ་མེད་པའི་རྒྱུད་ཐམས་ཅད་ཁོང་དུ་ཆུད་པ།
en: How could I know the conduct or describe the qualities of bodhisattvas who face in all directions; who have a scope of wisdom that is without division; who distribute their bodies throughout the realm of phenomena; who act in accord with the thoughts and aspirations of all beings; who pervade all realms with their bodies; who act in conformance with all phenomena; who have arrived at the equality of the three times; who have bodies that are equal to the range of phenomena in every direction; who illuminate every range of worlds of beings; who have no conceptualization of the range of tathāgatas; who enter all regions without impediment; and who dwell in the state that has no location?

source: གནས་མེད་པའི་རྒྱུད་ལ་རབ་ཏུ་གནས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་སྒོ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, there is a city named Dvāravatī.

source: དེ་ན་ལྷ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: There dwells the deity by the name of Mahādeva.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bodhisattva Ananyagāmin, circumambulated the bodhisattva Ananyagāmin many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bodhisattva Ananyagāmin.
